MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX256ZVLQ10/mcu.h
#define BUFHM                         0x7FFFFFFF80000000      // Buffer MBi Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_IMASK1 register.
//
//*****************************************************************************

#define BUFLM                         0x7FFFFFFF80000000      // Buffer MBi Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_IFLAG2 register.
//
//*****************************************************************************

#define BUFHI                         0x7FFFFFFF80000000      // Buffer MBi Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_IFLAG1 register.
//
//*****************************************************************************

#define BUF31TO8I                     0x7FFFFF80000000      // Buffer MBi Interrupt
#define BUF7I                         0x00000080      // Buffer MB7 Interrupt or "Rx FIFO Overflow"
#define BUF6I                         0x00000040      // Buffer MB6 Interrupt or "Rx FIFO Warning"
#define BUF5I                         0x00000020      // Buffer MB5 Interrupt or "Frames available in Rx FIFO"
#define BUF4TO0I                      0x000001F0      // Buffer MBi Interrupt or "reserved"


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_CTRL2 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // 
#define Reserved                      0xC0000000      // 
#define WRMFRZ                        0x10000000      // Write-Access to Memory in Freeze mode
#define RFFN                          0x78000000      // Number of Rx FIFO Filters
#define TASD                          0x0F800000      // Tx Arbitration Start Delay
#define MRP                           0x00040000      // Mailboxes Reception Priority
#define RRS                           0x00020000      // Remote Request Storing
#define EACEN                         0x00010000      // Entire Frame Arbitration Field Comparison Enable for Rx Mailboxes
#define Reserved                      0x7FFF8000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_ESR2 register.
//
//*****************************************************************************

#define Reserved                      0xFF80000000      // 
#define LPTM                          0x1FC00000      // Lowest Priority Tx Mailbox
#define Reserved                      0x00008000      // 
#define VPS                           0x00004000      // Valid Priority Status
#define IMB                           0x00002000      // Inactive Mailbox
#define Reserved                      0x01FFF000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_CRCR register.
//
//*****************************************************************************

#define Reserved                      0xFF80000000      // 
#define MBCRC                         0x1FC00000      // CRC Mailbox
#define Reserved                      0x00008000      // 
#define TXCRC                         0x1FFFC000      // CRC Transmitted


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXFGMASK register.
//
//*****************************************************************************

#define FGM[31:0]                     0x7FFFFFFF80000000      // Rx FIFO Global Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXFIR register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFF80000000      // 
#define IDHIT                         0x0001FF00      // Identifier Acceptance Filter Hit Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXIMR register.
//
//*****************************************************************************

#define MI[31:0]                      0x7FFFFFFF80000000      // Individual Mask Bits ::


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXIMRn register.
//
//*****************************************************************************

#define MI[31:0]                      0x7FFFFFFF80000000      // Individual Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the Message_Buffer_Structure register.
//
//*****************************************************************************

#define CODE                          0x780000000      // Message Buffer Code
#define SRR                           0x08000000      // Substitute Remote Request
#define IDE                           0x04000000      // ID Extended Bit
#define RTR                           0x02000000      // Remote Transmission Request
#define DLC                           0x0F000000      // Length of Data in Bytes
#define PRIO                          0x01F00000      // Local priority
#define ID                            0x7FFF8000      // Frame Identifier


//*****************************************************************************
//
// The following are defines for the bit fields in the Rx_FIFO_Structure register.
//
//*****************************************************************************




//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_DSADDR register.
//
//*****************************************************************************

#define DSADDR                        0x1FFFFFFF80000000      // This register contains the 32-bit system memory address for a DMA transfer. Since the address must be word (4 bytes) align, the least 2 bits are reserved, always 0. When the SDHC stops a DMA transfer, this register points to the system address of the next contiguous data position. It can be accessed only when no transaction is executing (i.e. after a transaction has stopped). Read operation during transfers may return an invalid value. The host driver shall initialize this register before starting a DMA transaction. After DMA has stopped, the system address of the next contiguous data position can be read from this register. This register is protected during a data transfer. When data lines are active, write to this register is ignored. The host driver shall wait, until the PRSSTAT[DLA] is cleared, before writing to this register. The SDHC internal DMA does not support a virtual memory system. It only supports continuous physical memory access. And due to AHB burst limitations, if the burst must cross the 1 KB boundary, SDHC will automatically change SEQ burst type to NSEQ. Since this register supports dynamic address reflecting, when IRQSTAT[TC] bit is set, it automatically alters the value of internal address counter, so SW cannot change this register when IRQSTAT[TC] bit is set.
#define Reserved                      0x00000006      // This read-only field is reserved and always has the value zero.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_BLKATTR register.
//
//*****************************************************************************

#define BLKCNT                        0x7FFF80000000      // This register is enabled when the XFERTYP[BCEN] is set to 1 and is valid only for multiple block transfers. For single block transfer, this register will always read as 1. The host driver shall set this register to a value between 1 and the maximum block count. The SDHC decrements the block count after each block transfer and stops when the count reaches zero. Setting the block count to 0 results in no data blocks being transferred. This register should be accessed only when no transaction is executing (that is after transactions are stopped). During data transfer, read operations on this register may return an invalid value and write operations are ignored. When saving transfer content as a result of a suspend command, the number of blocks yet to be transferred can be determined by reading this register. The reading of this register should be applied after transfer is paused by stop at block gap operation and before sending the command marked as suspend. This is because when suspend command is sent out, SDHC will regard the current transfer is aborted and change BLKCNT back to its original value instead of keeping the dynamical indicator of remained block count. When restoring transfer content prior to issuing a resume command, the host driver shall restore the previously saved block count. NOTE: Although the BLKCNT field is 0 after reset, the read of reset value is 0x1. This is because when XFERTYP[MSBSEL] bit is 0, indicating a single block transfer, the read value of BLKCNT is always 1. 0000h Stop count;; 0001h 1 block;; 0002h 2 blocks;; ...;; FFFFh 65535 blocks
#define Reserved                      0x00038000      // This read-only field is reserved and always has the value zero.
#define BLKSIZE                       0x01FFF000      // This register specifies the block size for block data transfers. Values ranging from 1 byte up to the maximum buffer size can be set. It can be accessed only when no transaction is executing (that is after a transaction has stopped). Read operations during transfers may return an invalid value, and write operations will be ignored. 000h No data transfer;; 001h 1 Byte;; 002h 2 Bytes;; 003h 3 Bytes;; 004h 4 Bytes;; ...;; 1FFh 511 Bytes;; 200h 512 Bytes;; ...;; 800h 2048 Bytes;; ...;; 1000h 4096 Bytes


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_CMDARG register.
//
//*****************************************************************************

